app/controllers/addresses_controller.rb

  def edit_with_user
    load_address
    @address.build_user if @address.user.blank?
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create_with_user
    @address = Address.create address_with_user_params
---
INSERT INTO "addresses" ("user_id", "street", "number", "floor", "department", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 2], ["street", "asdasd"], ["number", "wqeqwe"], ["floor", "wqewe"], ["department", "ee"], ["created_at", "2019-12-02 01:37:40.390100"], ["updated_at", "2019-12-02 01:37:40.390100"]]
INSERT INTO "users" ("name", "lastname", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "qwe"], ["lastname", "rer"], ["email", "qwewq"], ["created_at", "2019-12-02 01:37:40.356591"], ["updated_at", "2019-12-02 01:37:40.356591"]]

  def load_address
    @address ||= Address.find(params[:id])
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]