app/controllers/addresses_controller.rb

  def create_with_user
    @address = Address.create address_with_user_params
---
INSERT INTO "addresses" ("user_id", "street", "number", "zip_code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["street", "Fake street"], ["number", "123"], ["zip_code", "3434"], ["created_at", "2019-12-02 02:30:48.354345"], ["updated_at", "2019-12-02 02:30:48.354345"]]