app/controllers/users_controller.rb

INSERT INTO "addresses" ("user_id", "street", "number", "zip_code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["street", "Fake Street"], ["number", "123"], ["zip_code", "0"], ["created_at", "2019-12-02 02:30:03.915686"], ["updated_at", "2019-12-02 02:30:03.915686"]]
---
  def create_with_address
    @user = User.create user_with_address_params

INSERT INTO "addresses" ("user_id", "street", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 980190963], ["street", "Fake street"], ["created_at", "2019-12-02 01:31:12.309158"], ["updated_at", "2019-12-02 01:31:12.309158"]]
INSERT INTO "users" ("name", "lastname", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Name"], ["lastname", "Lastname"], ["email", "email@test.com"], ["created_at", "2019-12-01 22:45:39.695265"], ["updated_at", "2019-12-01 22:45:39.695265"]]
UPDATE "addresses" SET "street" = ?, "number" = ?, "zip_code" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["street", "Fake Street2"], ["number", "111"], ["zip_code", "1"], ["updated_at", "2019-12-02 02:32:41.009499"], ["id", 1]]
UPDATE "users" SET "name" = ?, "lastname" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Name2"], ["lastname", "Lastname2"], ["email", "email2@test.com"], ["updated_at", "2019-12-01 22:44:04.977006"], ["id", 980190963]]
---
  def update_with_address
    load_user
    @user.attributes = user_with_address_params

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]
---
  def load_user
    @user ||= User.find(params[:id])