app/controllers/users_controller.rb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def edit_with_address
    load_user

    # build the address if it's not present
    @user.build_address if @user.address.blank?

INSERT INTO "addresses" ("user_id", "street", "number", "floor", "department", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["street", ""], ["number", ""], ["floor", ""], ["department", ""], ["created_at", "2019-12-01 23:02:57.882615"], ["updated_at", "2019-12-01 23:02:57.882615"]]
INSERT INTO "users" ("name", "lastname", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["lastname", ""], ["email", ""], ["created_at", "2019-12-01 23:02:57.879607"], ["updated_at", "2019-12-01 23:02:57.879607"]]
---
  def create_with_address
    @user = User.create user_with_address_params

UPDATE "addresses" SET "street" = ?, "number" = ?, "floor" = ?, "department" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["street", "qweqw"], ["number", "ewqe"], ["floor", "ewwe"], ["department", "ewewe"], ["updated_at", "2019-12-02 01:40:50.902709"], ["id", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "asdsad@qw.ewe"], ["updated_at", "2019-12-02 01:40:50.897550"], ["id", 1]]
INSERT INTO "addresses" ("user_id", "street", "number", "zip_code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["street", "rwer"], ["number", "erer"], ["zip_code", "333"], ["created_at", "2019-12-02 02:38:45.055776"], ["updated_at", "2019-12-02 02:38:45.055776"]]
---
  def update_with_address
    load_user
    @user.attributes = user_with_address_params

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def load_user
    @user ||= User.find(params[:id])